export interface Province {
  name: string;
  cities: string[];
}

export const provinces: Province[] = [
  {
    name: "تهران",
    cities: ["تهران", "شهریار", "ورامین", "رباط کریم", "پاکدشت", "دماوند"],
  },
  {
    name: "اصفهان",
    cities: ["اصفهان", "کاشان", "نجف آباد", "خمینی شهر", "شاهین شهر"],
  },
  {
    name: "خراسان رضوی",
    cities: ["مشهد", "نیشابور", "سبزوار", "تربت حیدریه", "کاشمر"],
  },
  {
    name: "فارس",
    cities: ["شیراز", "مرودشت", "جهرم", "فسا", "کازرون"],
  },
  {
    name: "آذربایجان شرقی",
    cities: ["تبریز", "مراغه", "مرند", "اهر", "سراب"],
  },
  // ... سایر استان‌ها و شهرها
];
